package HomeWork2.Easy;

public class EasyLevelTask2 {
    public static void main(String[] args) {
        // Задание №2 - Написать цикл, который выводит через пробел 100 чисел с приставкой "a".
        // Ожидаемый результат: 1а 2а 3а .. 100а
        for (int i = 1; i <=100; i++) {
            System.out.print(i+"a"+" ");

        }
    }
}
